sleemanj/optiboot/dists/diy_atmega8_series/avr/boards.txt
atmega8_diy.menu.clock.16MHz=16MHz Crystal/Resonator
atmega8_diy.menu.clock.16MHz.build.f_cpu=16000000L
atmega8_diy.menu.clock.16MHz.bootloader.clock_bits=111111
atmega8_diy.menu.clock.16MHz.bootloader.ckopt_bit=0

atmega8_diy.menu.clock.12MHz=12MHz Crystal/Resonator
atmega8_diy.menu.clock.12MHz.build.f_cpu=12000000L
atmega8_diy.menu.clock.12MHz.bootloader.clock_bits=111111
atmega8_diy.menu.clock.12MHz.bootloader.ckopt_bit=0
atmega8_diy.menu.clock.12MHz.upload.speed=115200

atmega8_diy.menu.clock.4MHz=4MHz Internal Oscillator
atmega8_diy.menu.clock.4MHz.build.f_cpu=4000000L
atmega8_diy.menu.clock.4MHz.bootloader.clock_bits=100011
atmega8_diy.menu.clock.4MHz.bootloader.ckopt_bit=1
atmega8_diy.menu.clock.4MHz.upload.speed=38400

atmega8_diy.menu.clock.2MHz=2MHz Internal Oscillator
atmega8_diy.menu.clock.2MHz.build.f_cpu=2000000L
atmega8_diy.menu.clock.2MHz.bootloader.clock_bits=100010
atmega8_diy.menu.clock.2MHz.bootloader.ckopt_bit=1
atmega8_diy.menu.clock.2MHz.upload.speed=19200

atmega8_diy.menu.clock.1MHz=1MHz Internal Oscillator
atmega8_diy.menu.clock.1MHz.build.f_cpu=1000000L
atmega8_diy.menu.clock.1MHz.bootloader.clock_bits=100001
atmega8_diy.menu.clock.1MHz.bootloader.ckopt_bit=1
atmega8_diy.menu.clock.1MHz.upload.speed=9600


# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
atmega8_diy.menu.lto.enable=LTO Enabled
atmega8_diy.menu.lto.enable.ltocflags=-flto -fno-fat-lto-objects
atmega8_diy.menu.lto.enable.ltoelfflags=-g -flto -fuse-linker-plugin
atmega8_diy.menu.lto.enable.ltocppflags=-flto
atmega8_diy.menu.lto.enable.ltoarcmd=gcc-
atmega8_diy.menu.lto.disable=LTO Disabled
atmega8_diy.menu.lto.disable.ltocflags=
atmega8_diy.menu.lto.disable.ltoelfflags=
atmega8_diy.menu.lto.disable.ltocppflags=
atmega8_diy.menu.lto.disable.ltoarcmd=

# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
atmega8_diy.menu.bodlevel.2v7=2.7v
atmega8_diy.menu.bodlevel.2v7.bootloader.bod_bits=10
atmega8_diy.menu.bodlevel.disabled=Disabled
atmega8_diy.menu.bodlevel.disabled.bootloader.bod_bits=11
atmega8_diy.menu.bodlevel.4v0=4.0v
atmega8_diy.menu.bodlevel.4v0.bootloader.bod_bits=00


# Override: Clock Source Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega8_diy.menu.advclk.auto=Default

atmega8_diy.menu.advclk.i8=Internal Oscillator 8 MHz
atmega8_diy.menu.advclk.i8.bootloader.clock_bits=100100
atmega8_diy.menu.advclk.i8.bootloader.ckopt_bit=1
atmega8_diy.menu.advclk.i8.build.f_cpu=8000000L

atmega8_diy.menu.advclk.i4=Internal Oscillator 4 MHz
atmega8_diy.menu.advclk.i4.bootloader.clock_bits=100011
atmega8_diy.menu.advclk.i4.bootloader.ckopt_bit=1
atmega8_diy.menu.advclk.i4.build.f_cpu=4000000L

atmega8_diy.menu.advclk.i3=Internal Oscillator 2 MHz
atmega8_diy.menu.advclk.i3.bootloader.clock_bits=100010
atmega8_diy.menu.advclk.i3.bootloader.ckopt_bit=1
atmega8_diy.menu.advclk.i3.build.f_cpu=2000000L

atmega8_diy.menu.advclk.i1=Internal Oscillator 1 MHz
atmega8_diy.menu.advclk.i1.bootloader.clock_bits=100001
atmega8_diy.menu.advclk.i1.bootloader.ckopt_bit=1
atmega8_diy.menu.advclk.i1.build.f_cpu=1000000L

atmega8_diy.menu.advclk.xlf=Low Frequency Crystal/Resonator
atmega8_diy.menu.advclk.xlf.bootloader.clock_bits=101001
atmega8_diy.menu.advclk.xlf.bootloader.ckopt_bit=1

atmega8_diy.menu.advclk.xfs=Full Swing Crystal/Resonator 1+ MHz
atmega8_diy.menu.advclk.xfs.bootloader.clock_bits=111111
atmega8_diy.menu.advclk.xfs.bootloader.ckopt_bit=0

atmega8_diy.menu.advclk.x400=Crystal/Resonator 400-900 kHz
atmega8_diy.menu.advclk.x400.bootloader.clock_bits=111011
atmega8_diy.menu.advclk.x400.bootloader.ckopt_bit=1

atmega8_diy.menu.advclk.x900=Crystal/Resonator 900 kHz - 3 MHz
atmega8_diy.menu.advclk.x900.bootloader.clock_bits=111101
atmega8_diy.menu.advclk.x900.bootloader.ckopt_bit=1

atmega8_diy.menu.advclk.x3=Crystal/Resonator 3-8 MHz
atmega8_diy.menu.advclk.x3.bootloader.clock_bits=111111
atmega8_diy.menu.advclk.x3.bootloader.ckopt_bit=1

atmega8_diy.menu.advclk.x8=Crystal/Resonator 8+ MHz 
atmega8_diy.menu.advclk.x8.bootloader.clock_bits=111111
atmega8_diy.menu.advclk.x8.bootloader.ckopt_bit=0

atmega8_diy.menu.advclk.xc=External Clock (TCXO, OCXO...)
atmega8_diy.menu.advclk.xc.bootloader.clock_bits=100000
atmega8_diy.menu.advclk.xc.bootloader.ckopt_bit=1

atmega8_diy.menu.advclk.xrclf=External RC Oscillator <= 900 kHz
atmega8_diy.menu.advclk.xrclf.bootloader.clock_bits=100101
atmega8_diy.menu.advclk.xrclf.bootloader.ckopt_bit=1

atmega8_diy.menu.advclk.xrc900=External RC Oscillator 900 kHz - 3 MHz
atmega8_diy.menu.advclk.xrc900.bootloader.clock_bits=100110
atmega8_diy.menu.advclk.xrc900.bootloader.ckopt_bit=1

atmega8_diy.menu.advclk.xrc3=External RC Oscillator 3 MHz - 8 MHz
atmega8_diy.menu.advclk.xrc3.bootloader.clock_bits=100111
atmega8_diy.menu.advclk.xrc3.bootloader.ckopt_bit=1

atmega8_diy.menu.advclk.xrc8=External RC Oscillator 8 MHz - 12 MHz
atmega8_diy.menu.advclk.xrc8.bootloader.clock_bits=101000
atmega8_diy.menu.advclk.xrc8.bootloader.ckopt_bit=1


# Override: Frequency Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega8_diy.menu.advfrq.auto=Default

atmega8_diy.menu.advfrq.32k768=32.768 kHz
atmega8_diy.menu.advfrq.32k768.build.f_cpu=32768L
atmega8_diy.menu.advfrq.32k768.upload.speed=150

atmega8_diy.menu.advfrq.128k=128 kHz
atmega8_diy.menu.advfrq.128k.build.f_cpu=128000L
atmega8_diy.menu.advfrq.128k.upload.speed=300

atmega8_diy.menu.advfrq.1M=1 MHz
atmega8_diy.menu.advfrq.1M.build.f_cpu=1000000L
atmega8_diy.menu.advfrq.1M.upload.speed=9600

atmega8_diy.menu.advfrq.2M=2 MHz
atmega8_diy.menu.advfrq.2M.build.f_cpu=2000000L
atmega8_diy.menu.advfrq.2M.upload.speed=19200

atmega8_diy.menu.advfrq.4M=4 MHz
atmega8_diy.menu.advfrq.4M.build.f_cpu=4000000L
atmega8_diy.menu.advfrq.4M.upload.speed=38400

atmega8_diy.menu.advfrq.4M608=4.608 MHz
atmega8_diy.menu.advfrq.4M608.build.f_cpu=4608000L
atmega8_diy.menu.advfrq.4M608.upload.speed=115200

atmega8_diy.menu.advfrq.4M8=4.8 MHz
atmega8_diy.menu.advfrq.4M8.build.f_cpu=4800000L
atmega8_diy.menu.advfrq.4M8.upload.speed=19200

atmega8_diy.menu.advfrq.6M=6 MHz
atmega8_diy.menu.advfrq.6M.build.f_cpu=6000000L
atmega8_diy.menu.advfrq.6M.upload.speed=57600

