sleemanj/optiboot/dists/diy_atmega8_series/avr/boards.txt
atmega8_diy.menu.advfrq.6M4=6.4 MHz
atmega8_diy.menu.advfrq.6M4.build.f_cpu=6400000L
atmega8_diy.menu.advfrq.6M4.upload.speed=115200

atmega8_diy.menu.advfrq.8M=8 MHz
atmega8_diy.menu.advfrq.8M.build.f_cpu=8000000L
atmega8_diy.menu.advfrq.8M.upload.speed=38400

atmega8_diy.menu.advfrq.9M6=9.6 MHz
atmega8_diy.menu.advfrq.9M6.build.f_cpu=9600000L
atmega8_diy.menu.advfrq.9M6.upload.speed=57600

atmega8_diy.menu.advfrq.10M=10 MHz
atmega8_diy.menu.advfrq.10M.build.f_cpu=10000000L
atmega8_diy.menu.advfrq.10M.upload.speed=115200

atmega8_diy.menu.advfrq.12M=12 MHz
atmega8_diy.menu.advfrq.12M.build.f_cpu=12000000L
atmega8_diy.menu.advfrq.12M.upload.speed=115200

atmega8_diy.menu.advfrq.12M8=12.8 MHz
atmega8_diy.menu.advfrq.12M8.build.f_cpu=12800000L
atmega8_diy.menu.advfrq.12M8.upload.speed=115200

atmega8_diy.menu.advfrq.15M36=15.36 MHz
atmega8_diy.menu.advfrq.15M36.build.f_cpu=15360000L
atmega8_diy.menu.advfrq.15M36.upload.speed=57600

atmega8_diy.menu.advfrq.16M=16 MHz
atmega8_diy.menu.advfrq.16M.build.f_cpu=16000000L
atmega8_diy.menu.advfrq.16M.upload.speed=57600

atmega8_diy.menu.advfrq.19M2=19.2 MHz
atmega8_diy.menu.advfrq.19M2.build.f_cpu=19200000L
atmega8_diy.menu.advfrq.19M2.upload.speed=115200

atmega8_diy.menu.advfrq.20M=20 MHz
atmega8_diy.menu.advfrq.20M.build.f_cpu=20000000L
atmega8_diy.menu.advfrq.20M.upload.speed=115200

atmega8_diy.menu.advfrq.24M=24 MHz
atmega8_diy.menu.advfrq.24M.build.f_cpu=24000000L
atmega8_diy.menu.advfrq.24M.upload.speed=115200

# Override: Upload Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega8_diy.menu.advups.auto=Default

atmega8_diy.menu.advups.115200=115200
atmega8_diy.menu.advups.115200.upload.speed=115200

atmega8_diy.menu.advups.57600=57600
atmega8_diy.menu.advups.57600.upload.speed=57600

atmega8_diy.menu.advups.38400=38400
atmega8_diy.menu.advups.38400.upload.speed=38400

atmega8_diy.menu.advups.19200=19200
atmega8_diy.menu.advups.19200.upload.speed=19200

atmega8_diy.menu.advups.9600=9600
atmega8_diy.menu.advups.9600.upload.speed=9600

atmega8_diy.menu.advups.2400=2400
atmega8_diy.menu.advups.2400.upload.speed=2400

atmega8_diy.menu.advups.1200=1200
atmega8_diy.menu.advups.1200.upload.speed=1200

atmega8_diy.menu.advups.300=300
atmega8_diy.menu.advups.300.upload.speed=300

atmega8_diy.menu.advups.150=150
atmega8_diy.menu.advups.150.upload.speed=150


# Override: CKOPT Fuse
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega8_diy.menu.advckopt.auto=Default

atmega8_diy.menu.advckopt.programmed=CKOPT = 0
atmega8_diy.menu.advckopt.programmed.bootloader.ckopt_bit=0

atmega8_diy.menu.advckopt.unprogrammed=CKOPT = 1
atmega8_diy.menu.advckopt.unprogrammed.bootloader.ckopt_bit=1

# }}}



################################################################################
# ATMEGA48p
#
# The ATMega48p has a small problem in the Arduino 1.0.5 because it's included 
# avrdude doesn't support it, and will report an incorrect signature or unknown
# device type.  1.6.x is fine.
#
# To fix this, edit your avrdude.conf, duplicate the section for the ATMega48 
# and change the duplicated section such that:
#
#   id = "m48p";
#   desc = "ATmega48P";
#   signature = 0x1e 0x92 0x0a;
#
# The 48 does not have a separate boot section of memory, so this means that
# optiboot uses a virtual boot method, this has a couple effects, firstly
# it takes more flash for the boot process, secondly it sacrifices the SPM_RDY
# interrupt vector, and thirdly it means that the lock bits 
# are just the simple set as with no bootloader
#
################################################################################
# {{{

atmega48p_diy.name=ATmega48/A/P/PA/PB
atmega48p_diy.bootloader.low_fuses=0xE2
atmega48p_diy.bootloader.high_fuses=0b11011{bootloader.bod_bits}
atmega48p_diy.bootloader.bod_bits=101
atmega48p_diy.bootloader.extended_fuses=0x00
atmega48p_diy.bootloader.unlock_bits=0x3F
atmega48p_diy.bootloader.lock_bits=0x3F
atmega48p_diy.build.mcu=atmega48p
atmega48p_diy.build.f_cpu=8000000L
atmega48p_diy.upload.speed=57600
atmega48p_diy.build.core=arduino:arduino
atmega48p_diy.build.variant=arduino:standard
atmega48p_diy.build.board=ATMEGA48_DIY
atmega48p_diy.upload.tool=arduino:avrdude
atmega48p_diy.bootloader.tool=arduino:avrdude

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega48p_diy.menu.version.atmega48pa = Atmega48PA
atmega48p_diy.menu.version.atmega48pa.build.mcu = atmega48p


atmega48p_diy.menu.version.atmega48p = Atmega48P
atmega48p_diy.menu.version.atmega48p.build.mcu = atmega48p

atmega48p_diy.menu.version.atmega48pb = Atmega48PB
atmega48p_diy.menu.version.atmega48pb.build.mcu = atmega48p

atmega48p_diy.menu.version.atmega48a = Atmega48A
atmega48p_diy.menu.version.atmega48a.build.mcu = atmega48

atmega48p_diy.menu.version.atmega48  = ATmega48
atmega48p_diy.menu.version.atmega48.build.mcu = atmega48


# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega48p_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
atmega48p_diy.menu.boot.optiboot.upload.protocol=arduino
atmega48p_diy.menu.boot.optiboot.upload.maximum_size=3538
atmega48p_diy.menu.boot.optiboot.bootloader.high_fuses=0xDD
atmega48p_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex
atmega48p_diy.menu.boot.optiboot.bootloader.noblink=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

atmega48p_diy.menu.boot.optiboot_notuner=Yes, Without Tuner
atmega48p_diy.menu.boot.optiboot_notuner.upload.protocol=arduino
atmega48p_diy.menu.boot.optiboot_notuner.upload.maximum_size=3554
atmega48p_diy.menu.boot.optiboot_notuner.bootloader.high_fuses=0xDD
atmega48p_diy.menu.boot.optiboot_notuner.bootloader.file=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

atmega48p_diy.menu.boot.none=No (ISP Programmer Upload)
atmega48p_diy.menu.boot.none.upload.maximum_size=4096
atmega48p_diy.menu.boot.none.bootloader.high_fuses=0xDD
atmega48p_diy.menu.boot.none.upload.tool=arduino:avrdude
atmega48p_diy.menu.boot.none.bootloader.tool=avrdude_nobootloader


# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega48p_diy.menu.clock.8MHz=8MHz Internal Oscillator
atmega48p_diy.menu.clock.8MHz.build.f_cpu=8000000L
atmega48p_diy.menu.clock.8MHz.upload.speed=38400
atmega48p_diy.menu.clock.8MHz.bootloader.low_fuses=0xE2

atmega48p_diy.menu.clock.20MHz=20MHz Crystal/Resonator
atmega48p_diy.menu.clock.20MHz.build.f_cpu=20000000L
atmega48p_diy.menu.clock.20MHz.bootloader.low_fuses=0xFF

atmega48p_diy.menu.clock.19_2MHz=19.2MHz Crystal/Resonator
atmega48p_diy.menu.clock.19_2MHz.build.f_cpu=19200000L
atmega48p_diy.menu.clock.19_2MHz.bootloader.low_fuses=0xFF

atmega48p_diy.menu.clock.16MHz=16MHz Crystal/Resonator
atmega48p_diy.menu.clock.16MHz.build.f_cpu=16000000L
atmega48p_diy.menu.clock.16MHz.bootloader.low_fuses=0xF7

atmega48p_diy.menu.clock.1MHz=1MHz Internal Oscillator
atmega48p_diy.menu.clock.1MHz.build.f_cpu=1000000L
atmega48p_diy.menu.clock.1MHz.bootloader.low_fuses=0x62
atmega48p_diy.menu.clock.1MHz.upload.speed=9600

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
atmega48p_diy.menu.lto.enable=LTO Enabled
atmega48p_diy.menu.lto.enable.ltocflags=-flto -fno-fat-lto-objects
atmega48p_diy.menu.lto.enable.ltoelfflags=-g -flto -fuse-linker-plugin
atmega48p_diy.menu.lto.enable.ltocppflags=-flto
atmega48p_diy.menu.lto.enable.ltoarcmd=gcc-
atmega48p_diy.menu.lto.disable=LTO Disabled
atmega48p_diy.menu.lto.disable.ltocflags=
atmega48p_diy.menu.lto.disable.ltoelfflags=
atmega48p_diy.menu.lto.disable.ltocppflags=
atmega48p_diy.menu.lto.disable.ltoarcmd=

