sleemanj/optiboot/dists/diy_atmega8_series/avr/boards.txt
# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
atmega48p_diy.menu.bodlevel.2v7=2.7v
atmega48p_diy.menu.bodlevel.2v7.bootloader.bod_bits=101
atmega48p_diy.menu.bodlevel.disabled=Disabled
atmega48p_diy.menu.bodlevel.disabled.bootloader.bod_bits=111
atmega48p_diy.menu.bodlevel.4v3=4.3v
atmega48p_diy.menu.bodlevel.4v3.bootloader.bod_bits=100
atmega48p_diy.menu.bodlevel.1v8=1.8v
atmega48p_diy.menu.bodlevel.1v8.bootloader.bod_bits=110

# Override: Clock Source Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega48p_diy.menu.advclk.auto=Default

atmega48p_diy.menu.advclk.i8=Internal Oscillator 8 MHz
atmega48p_diy.menu.advclk.i8.bootloader.low_fuses=0xE2
atmega48p_diy.menu.advclk.i8.build.f_cpu=8000000L

atmega48p_diy.menu.advclk.i1=Internal Oscillator 1 MHz
atmega48p_diy.menu.advclk.i1.bootloader.low_fuses=0x62
atmega48p_diy.menu.advclk.i1.build.f_cpu=1000000L

atmega48p_diy.menu.advclk.i128=Internal Oscillator 128 kHz
atmega48p_diy.menu.advclk.i128.bootloader.low_fuses=0xE3
atmega48p_diy.menu.advclk.i128.build.f_cpu=128000L

atmega48p_diy.menu.advclk.xlf=Low Frequency Crystal/Resonator
atmega48p_diy.menu.advclk.xlf.bootloader.low_fuses=0xE5

atmega48p_diy.menu.advclk.xlf=Full Swing Crystal/Resonator 0.4-20 MHz
atmega48p_diy.menu.advclk.xlf.bootloader.low_fuses=0xF7

atmega48p_diy.menu.advclk.x400=Crystal/Resonator 400-900 kHz
atmega48p_diy.menu.advclk.x400.bootloader.low_fuses=0xF9

atmega48p_diy.menu.advclk.x900=Crystal/Resonator 900 kHz - 3 MHz
atmega48p_diy.menu.advclk.x900.bootloader.low_fuses=0xFB

atmega48p_diy.menu.advclk.x3=Crystal/Resonator 3-8 MHz
atmega48p_diy.menu.advclk.x3.bootloader.low_fuses=0xFD

atmega48p_diy.menu.advclk.x8=Crystal/Resonator 8-16 MHz 
atmega48p_diy.menu.advclk.x8.bootloader.low_fuses=0xFF

atmega48p_diy.menu.advclk.xc=External Clock (TCXO, OCXO...)
atmega48p_diy.menu.advclk.xc.bootloader.low_fuses=0xE0

# Override: Frequency Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega48p_diy.menu.advfrq.auto=Default

atmega48p_diy.menu.advfrq.32k768=32.768 kHz
atmega48p_diy.menu.advfrq.32k768.build.f_cpu=32768L
atmega48p_diy.menu.advfrq.32k768.upload.speed=150

atmega48p_diy.menu.advfrq.128k=128 kHz
atmega48p_diy.menu.advfrq.128k.build.f_cpu=128000L
atmega48p_diy.menu.advfrq.128k.upload.speed=300

atmega48p_diy.menu.advfrq.1M=1 MHz
atmega48p_diy.menu.advfrq.1M.build.f_cpu=1000000L
atmega48p_diy.menu.advfrq.1M.upload.speed=9600

atmega48p_diy.menu.advfrq.2M=2 MHz
atmega48p_diy.menu.advfrq.2M.build.f_cpu=2000000L
atmega48p_diy.menu.advfrq.2M.upload.speed=19200

atmega48p_diy.menu.advfrq.4M=4 MHz
atmega48p_diy.menu.advfrq.4M.build.f_cpu=4000000L
atmega48p_diy.menu.advfrq.4M.upload.speed=38400

atmega48p_diy.menu.advfrq.4M608=4.608 MHz
atmega48p_diy.menu.advfrq.4M608.build.f_cpu=4608000L
atmega48p_diy.menu.advfrq.4M608.upload.speed=115200

atmega48p_diy.menu.advfrq.4M8=4.8 MHz
atmega48p_diy.menu.advfrq.4M8.build.f_cpu=4800000L
atmega48p_diy.menu.advfrq.4M8.upload.speed=19200

atmega48p_diy.menu.advfrq.6M=6 MHz
atmega48p_diy.menu.advfrq.6M.build.f_cpu=6000000L
atmega48p_diy.menu.advfrq.6M.upload.speed=57600

atmega48p_diy.menu.advfrq.6M4=6.4 MHz
atmega48p_diy.menu.advfrq.6M4.build.f_cpu=6400000L
atmega48p_diy.menu.advfrq.6M4.upload.speed=115200

atmega48p_diy.menu.advfrq.8M=8 MHz
atmega48p_diy.menu.advfrq.8M.build.f_cpu=8000000L
atmega48p_diy.menu.advfrq.8M.upload.speed=38400

atmega48p_diy.menu.advfrq.9M6=9.6 MHz
atmega48p_diy.menu.advfrq.9M6.build.f_cpu=9600000L
atmega48p_diy.menu.advfrq.9M6.upload.speed=57600

atmega48p_diy.menu.advfrq.10M=10 MHz
atmega48p_diy.menu.advfrq.10M.build.f_cpu=10000000L
atmega48p_diy.menu.advfrq.10M.upload.speed=115200

atmega48p_diy.menu.advfrq.12M=12 MHz
atmega48p_diy.menu.advfrq.12M.build.f_cpu=12000000L
atmega48p_diy.menu.advfrq.12M.upload.speed=115200

atmega48p_diy.menu.advfrq.12M8=12.8 MHz
atmega48p_diy.menu.advfrq.12M8.build.f_cpu=12800000L
atmega48p_diy.menu.advfrq.12M8.upload.speed=115200

atmega48p_diy.menu.advfrq.15M36=15.36 MHz
atmega48p_diy.menu.advfrq.15M36.build.f_cpu=15360000L
atmega48p_diy.menu.advfrq.15M36.upload.speed=57600

atmega48p_diy.menu.advfrq.16M=16 MHz
atmega48p_diy.menu.advfrq.16M.build.f_cpu=16000000L
atmega48p_diy.menu.advfrq.16M.upload.speed=57600

atmega48p_diy.menu.advfrq.19M2=19.2 MHz
atmega48p_diy.menu.advfrq.19M2.build.f_cpu=19200000L
atmega48p_diy.menu.advfrq.19M2.upload.speed=115200

atmega48p_diy.menu.advfrq.20M=20 MHz
atmega48p_diy.menu.advfrq.20M.build.f_cpu=20000000L
atmega48p_diy.menu.advfrq.20M.upload.speed=115200

atmega48p_diy.menu.advfrq.24M=24 MHz
atmega48p_diy.menu.advfrq.24M.build.f_cpu=24000000L
atmega48p_diy.menu.advfrq.24M.upload.speed=115200

# Override: Upload Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega48p_diy.menu.advups.auto=Default

atmega48p_diy.menu.advups.115200=115200
atmega48p_diy.menu.advups.115200.upload.speed=115200

atmega48p_diy.menu.advups.57600=57600
atmega48p_diy.menu.advups.57600.upload.speed=57600

atmega48p_diy.menu.advups.38400=38400
atmega48p_diy.menu.advups.38400.upload.speed=38400

atmega48p_diy.menu.advups.19200=19200
atmega48p_diy.menu.advups.19200.upload.speed=19200

atmega48p_diy.menu.advups.9600=9600
atmega48p_diy.menu.advups.9600.upload.speed=9600

atmega48p_diy.menu.advups.2400=2400
atmega48p_diy.menu.advups.2400.upload.speed=2400

atmega48p_diy.menu.advups.1200=1200
atmega48p_diy.menu.advups.1200.upload.speed=1200

atmega48p_diy.menu.advups.300=300
atmega48p_diy.menu.advups.300.upload.speed=300

atmega48p_diy.menu.advups.150=150
atmega48p_diy.menu.advups.150.upload.speed=150

# }}}


################################################################################
# ATMEGA328(P)
#
# EXTENDED FUSES NOTES
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# avrdude masks out some bits of the extended fuse on read, which would result 
# in verification error of the extended fuse if you give it an unmasked value
#
# The best idea is to use this fuse calculator
#
#     http://www.engbedded.com/fusecalc/ 
#
# which will helpfully tell you in red underneat the AVRDUDE arguments section
# if you should change the fuse, for example if you use that calculator with
# say "F5" for the extended fuse, and ATMega328P selected as the part name,
# then it will tell you "Note that there are some...." and that you  should use 
# "Extended: 0x05" instead.
#
#
# 1.0.5 Compatability Note
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 
#  1.0.5 has some minor problems with the non-p ATmega328 (the 328p is fine).
#
#   1: avrdude bundled in the IDE may not know about the non-p 328p signature
#       - characterised by a signature mismatch when you try and burn bootloader
#   2: avr-gcc bundled in the IDE doesn't know about the non-p at all
#       - characterised by the error "atmega328 supported for assembler only"
#
# Problem 1 can be solved by editing avrdude.conf and copying the existing m328p 
# section to make an m328 section, by changing the
#   id to m328
#   desc to ATMEGA328
#   signature to 0x1e 0x95 0x14
# You can then burn a bootloader, easy.
# 
# Problem 2 can be solved in 1 of 2 way, either;
#   a) After solving (1), use the IDE to burn the bootloader for the non-p
#       variant (eg "ATmega328 8MHz Internal Clock"), and then change the
#       selected board in the IDE to the P (eg "ATmega328p 8MHz Internal Clock")
#       variant, from which point on you can upload USING THE BOOTLOADER ONLY
#       this works because of the following reasons - you don't need to know, 
#       just if you are curious, or I want to remind myself...
#
#             i) The optiboot.c bootloader reports the signature to avrdude
#                by outputting the 3 bytes from the defines SIGNATURE_0..2 
#
#            ii) These defines are provided by avr libc from the specific files
#                /usr/lib/avr/include/avr/iom*.h
#
#           iii) The specific file (only one is included ultimately) is included
#                from /usr/lib/avr/include/avr/io.h 
#
#            iv) That file includes the iom328p.h for BOTH the 328 and the 328p
#                and it sets SIGNATURE_0..2 to the 328p bytes regardless.
#
#             v) Thus, optiboot reports the 328p bytes for both 328 and 328p
#
#            vi) Therefore when avrdude asks optiboot for the signature bytes
#                when it is on an atmega328 (non-p) it will give the bytes for 
#                the atmega328p instead, and everybody is happy.
#       
#   b) Instead of solving problem 1 in the correct manner, just change the 
#       signature bytes of the m328p section to 0x1e 0x95 0x14 and then select 
#        the P  board in your IDE (eg "ATmega328p 8MHz Internal Clock"), this 
#        works because now both the IDE and avrdude think your chip is a "p", 
#        which is fine since for your purposes they are identical.
#
################################################################################
# {{{

atmega328_diy.name=ATmega328/P/PB
atmega328_diy.bootloader.low_fuses=0xE2
atmega328_diy.bootloader.high_fuses=0b11011{bootloader.bod_bits}
atmega328_diy.bootloader.bod_bits=101
atmega328_diy.bootloader.extended_fuses=0x05
atmega328_diy.bootloader.unlock_bits=0x3F
atmega328_diy.bootloader.lock_bits=0x3F
atmega328_diy.build.mcu=atmega328p
atmega328_diy.build.f_cpu=8000000L
atmega328_diy.upload.speed=57600
atmega328_diy.build.core=arduino:arduino
atmega328_diy.build.variant=arduino:standard
atmega328_diy.build.board=ATMEGA328_DIY
atmega328_diy.upload.tool=arduino:avrdude
atmega328_diy.bootloader.tool=arduino:avrdude

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega328_diy.menu.version.atmega328p = Atmega328P
atmega328_diy.menu.version.atmega328p.build.mcu = atmega328p

atmega328_diy.menu.version.atmega328pb = Atmega328PB
atmega328_diy.menu.version.atmega328pb.build.mcu = atmega328p

atmega328_diy.menu.version.atmega328  = ATmega328
atmega328_diy.menu.version.atmega328.build.mcu = atmega328

