sleemanj/optiboot/dists/diy_atmega8_series/avr/boards.txt
# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega328_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
atmega328_diy.menu.boot.optiboot.upload.protocol=arduino
atmega328_diy.menu.boot.optiboot.upload.maximum_size=32256
atmega328_diy.menu.boot.optiboot.bootloader.high_fuses=0xDE
atmega328_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex
atmega328_diy.menu.boot.optiboot.bootloader.noblink=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

atmega328_diy.menu.boot.none=No (ISP Programmer Upload)
atmega328_diy.menu.boot.none.upload.maximum_size=32768
atmega328_diy.menu.boot.none.bootloader.high_fuses=0xDF
atmega328_diy.menu.boot.none.upload.tool=arduino:avrdude
atmega328_diy.menu.boot.none.bootloader.tool=avrdude_nobootloader


# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega328_diy.menu.clock.8MHz=8MHz Internal Oscillator
atmega328_diy.menu.clock.8MHz.build.f_cpu=8000000L
atmega328_diy.menu.clock.8MHz.upload.speed=38400
atmega328_diy.menu.clock.8MHz.bootloader.low_fuses=0xE2

atmega328_diy.menu.clock.20MHz=20MHz Crystal/Resonator
atmega328_diy.menu.clock.20MHz.build.f_cpu=20000000L
atmega328_diy.menu.clock.20MHz.bootloader.low_fuses=0xFF

atmega328_diy.menu.clock.19_2MHz=19.MHz Crystal/Resonator
atmega328_diy.menu.clock.19_2MHz.build.f_cpu=19200000L
atmega328_diy.menu.clock.19_2MHz.bootloader.low_fuses=0xFF

atmega328_diy.menu.clock.16MHz=16MHz Crystal/Resonator
atmega328_diy.menu.clock.16MHz.build.f_cpu=16000000L
atmega328_diy.menu.clock.16MHz.bootloader.low_fuses=0xFF

atmega328_diy.menu.clock.1MHz=1MHz Internal Oscillator
atmega328_diy.menu.clock.1MHz.build.f_cpu=1000000L
atmega328_diy.menu.clock.1MHz.bootloader.low_fuses=0x62
atmega328_diy.menu.clock.1MHz.upload.speed=9600

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
atmega328_diy.menu.lto.enable=LTO Enabled
atmega328_diy.menu.lto.enable.ltocflags=-flto -fno-fat-lto-objects
atmega328_diy.menu.lto.enable.ltoelfflags=-g -flto -fuse-linker-plugin
atmega328_diy.menu.lto.enable.ltocppflags=-flto
atmega328_diy.menu.lto.enable.ltoarcmd=gcc-
atmega328_diy.menu.lto.disable=LTO Disabled
atmega328_diy.menu.lto.disable.ltocflags=
atmega328_diy.menu.lto.disable.ltoelfflags=
atmega328_diy.menu.lto.disable.ltocppflags=
atmega328_diy.menu.lto.disable.ltoarcmd=

# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
atmega328_diy.menu.bodlevel.2v7=2.7v
atmega328_diy.menu.bodlevel.2v7.bootloader.bod_bits=101
atmega328_diy.menu.bodlevel.disabled=Disabled
atmega328_diy.menu.bodlevel.disabled.bootloader.bod_bits=111
atmega328_diy.menu.bodlevel.4v3=4.3v
atmega328_diy.menu.bodlevel.4v3.bootloader.bod_bits=100
atmega328_diy.menu.bodlevel.1v8=1.8v
atmega328_diy.menu.bodlevel.1v8.bootloader.bod_bits=110

# Override: Clock Source Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega328_diy.menu.advclk.auto=Default

atmega328_diy.menu.advclk.i8=Internal Oscillator 8 MHz
atmega328_diy.menu.advclk.i8.bootloader.low_fuses=0xE2
atmega328_diy.menu.advclk.i8.build.f_cpu=8000000L

atmega328_diy.menu.advclk.i1=Internal Oscillator 1 MHz
atmega328_diy.menu.advclk.i1.bootloader.low_fuses=0x62
atmega328_diy.menu.advclk.i1.build.f_cpu=1000000L

atmega328_diy.menu.advclk.i128=Internal Oscillator 128 kHz
atmega328_diy.menu.advclk.i128.bootloader.low_fuses=0xE3
atmega328_diy.menu.advclk.i128.build.f_cpu=128000L

atmega328_diy.menu.advclk.xlf=Low Frequency Crystal/Resonator
atmega328_diy.menu.advclk.xlf.bootloader.low_fuses=0xE5

atmega328_diy.menu.advclk.xlf=Full Swing Crystal/Resonator 0.4-20 MHz
atmega328_diy.menu.advclk.xlf.bootloader.low_fuses=0xF7

atmega328_diy.menu.advclk.x400=Crystal/Resonator 400-900 kHz
atmega328_diy.menu.advclk.x400.bootloader.low_fuses=0xF9

atmega328_diy.menu.advclk.x900=Crystal/Resonator 900 kHz - 3 MHz
atmega328_diy.menu.advclk.x900.bootloader.low_fuses=0xFB

atmega328_diy.menu.advclk.x3=Crystal/Resonator 3-8 MHz
atmega328_diy.menu.advclk.x3.bootloader.low_fuses=0xFD

atmega328_diy.menu.advclk.x8=Crystal/Resonator 8-16 MHz 
atmega328_diy.menu.advclk.x8.bootloader.low_fuses=0xFF

atmega328_diy.menu.advclk.xc=External Clock (TCXO, OCXO...)
atmega328_diy.menu.advclk.xc.bootloader.low_fuses=0xE0

# Override: Frequency Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega328_diy.menu.advfrq.auto=Default

atmega328_diy.menu.advfrq.32k768=32.768 kHz
atmega328_diy.menu.advfrq.32k768.build.f_cpu=32768L
atmega328_diy.menu.advfrq.32k768.upload.speed=150

atmega328_diy.menu.advfrq.128k=128 kHz
atmega328_diy.menu.advfrq.128k.build.f_cpu=128000L
atmega328_diy.menu.advfrq.128k.upload.speed=300

atmega328_diy.menu.advfrq.1M=1 MHz
atmega328_diy.menu.advfrq.1M.build.f_cpu=1000000L
atmega328_diy.menu.advfrq.1M.upload.speed=9600

atmega328_diy.menu.advfrq.2M=2 MHz
atmega328_diy.menu.advfrq.2M.build.f_cpu=2000000L
atmega328_diy.menu.advfrq.2M.upload.speed=19200

atmega328_diy.menu.advfrq.4M=4 MHz
atmega328_diy.menu.advfrq.4M.build.f_cpu=4000000L
atmega328_diy.menu.advfrq.4M.upload.speed=38400

atmega328_diy.menu.advfrq.4M608=4.608 MHz
atmega328_diy.menu.advfrq.4M608.build.f_cpu=4608000L
atmega328_diy.menu.advfrq.4M608.upload.speed=115200

atmega328_diy.menu.advfrq.4M8=4.8 MHz
atmega328_diy.menu.advfrq.4M8.build.f_cpu=4800000L
atmega328_diy.menu.advfrq.4M8.upload.speed=19200

atmega328_diy.menu.advfrq.6M=6 MHz
atmega328_diy.menu.advfrq.6M.build.f_cpu=6000000L
atmega328_diy.menu.advfrq.6M.upload.speed=57600

atmega328_diy.menu.advfrq.6M4=6.4 MHz
atmega328_diy.menu.advfrq.6M4.build.f_cpu=6400000L
atmega328_diy.menu.advfrq.6M4.upload.speed=115200

atmega328_diy.menu.advfrq.8M=8 MHz
atmega328_diy.menu.advfrq.8M.build.f_cpu=8000000L
atmega328_diy.menu.advfrq.8M.upload.speed=38400

