sleemanj/optiboot/dists/diy_atmega8_series/avr/boards.txt
atmega328_diy.menu.advfrq.9M6=9.6 MHz
atmega328_diy.menu.advfrq.9M6.build.f_cpu=9600000L
atmega328_diy.menu.advfrq.9M6.upload.speed=57600

atmega328_diy.menu.advfrq.10M=10 MHz
atmega328_diy.menu.advfrq.10M.build.f_cpu=10000000L
atmega328_diy.menu.advfrq.10M.upload.speed=115200

atmega328_diy.menu.advfrq.12M=12 MHz
atmega328_diy.menu.advfrq.12M.build.f_cpu=12000000L
atmega328_diy.menu.advfrq.12M.upload.speed=115200

atmega328_diy.menu.advfrq.12M8=12.8 MHz
atmega328_diy.menu.advfrq.12M8.build.f_cpu=12800000L
atmega328_diy.menu.advfrq.12M8.upload.speed=115200

atmega328_diy.menu.advfrq.15M36=15.36 MHz
atmega328_diy.menu.advfrq.15M36.build.f_cpu=15360000L
atmega328_diy.menu.advfrq.15M36.upload.speed=57600

atmega328_diy.menu.advfrq.16M=16 MHz
atmega328_diy.menu.advfrq.16M.build.f_cpu=16000000L
atmega328_diy.menu.advfrq.16M.upload.speed=57600

atmega328_diy.menu.advfrq.19M2=19.2 MHz
atmega328_diy.menu.advfrq.19M2.build.f_cpu=19200000L
atmega328_diy.menu.advfrq.19M2.upload.speed=115200

atmega328_diy.menu.advfrq.20M=20 MHz
atmega328_diy.menu.advfrq.20M.build.f_cpu=20000000L
atmega328_diy.menu.advfrq.20M.upload.speed=115200

atmega328_diy.menu.advfrq.24M=24 MHz
atmega328_diy.menu.advfrq.24M.build.f_cpu=24000000L
atmega328_diy.menu.advfrq.24M.upload.speed=115200

# Override: Upload Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega328_diy.menu.advups.auto=Default

atmega328_diy.menu.advups.115200=115200
atmega328_diy.menu.advups.115200.upload.speed=115200

atmega328_diy.menu.advups.57600=57600
atmega328_diy.menu.advups.57600.upload.speed=57600

atmega328_diy.menu.advups.38400=38400
atmega328_diy.menu.advups.38400.upload.speed=38400

atmega328_diy.menu.advups.19200=19200
atmega328_diy.menu.advups.19200.upload.speed=19200

atmega328_diy.menu.advups.9600=9600
atmega328_diy.menu.advups.9600.upload.speed=9600

atmega328_diy.menu.advups.2400=2400
atmega328_diy.menu.advups.2400.upload.speed=2400

atmega328_diy.menu.advups.1200=1200
atmega328_diy.menu.advups.1200.upload.speed=1200

atmega328_diy.menu.advups.300=300
atmega328_diy.menu.advups.300.upload.speed=300

atmega328_diy.menu.advups.150=150
atmega328_diy.menu.advups.150.upload.speed=150

# }}}




################################################################################
# ATMEGA88/A/P/PA/PB
#
# EXTENDED FUSES NOTES
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# avrdude masks out some bits of the extended fuse on read, which would result 
# in verification error of the extended fuse if you give it an unmasked value
#
# The best idea is to use this fuse calculator
#
#     http://www.engbedded.com/fusecalc/ 
#
# which will helpfully tell you in red underneat the AVRDUDE arguments section
# if you should change the fuse, for example if you use that calculator with
# say "F5" for the extended fuse, and ATMega328P selected as the part name,
# then it will tell you "Note that there are some...." and that you  should use 
# "Extended: 0x05" instead.
#
#
################################################################################
# {{{

atmega88_diy.name=ATmega88/A/P/PA/PB
atmega88_diy.bootloader.low_fuses=0xE2
atmega88_diy.bootloader.high_fuses=0b11011{bootloader.bod_bits}
atmega88_diy.bootloader.bod_bits=101
atmega88_diy.bootloader.extended_fuses=0x04
atmega88_diy.bootloader.unlock_bits=0x3F
atmega88_diy.bootloader.lock_bits=0x3F
atmega88_diy.build.mcu=atmega88p
atmega88_diy.build.f_cpu=8000000L
atmega88_diy.upload.speed=57600
atmega88_diy.build.core=arduino:arduino
atmega88_diy.build.variant=arduino:standard
atmega88_diy.build.board=ATMEGA88_DIY
atmega88_diy.upload.tool=arduino:avrdude
atmega88_diy.bootloader.tool=arduino:avrdude

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega88_diy.menu.version.atmega88p = Atmega88P
atmega88_diy.menu.version.atmega88p.build.mcu = atmega88p

atmega88_diy.menu.version.atmega88pa = Atmega88PA
atmega88_diy.menu.version.atmega88pa.build.mcu = atmega88p

atmega88_diy.menu.version.atmega88pb = Atmega88PB
atmega88_diy.menu.version.atmega88pb.build.mcu = atmega88p

atmega88_diy.menu.version.atmega88  = ATmega88
atmega88_diy.menu.version.atmega88.build.mcu = atmega88

atmega88_diy.menu.version.atmega88a  = ATmega88A
atmega88_diy.menu.version.atmega88a.build.mcu = atmega88

# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega88_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
atmega88_diy.menu.boot.optiboot.upload.protocol=arduino
atmega88_diy.menu.boot.optiboot.upload.maximum_size=7680
atmega88_diy.menu.boot.optiboot.bootloader.extended_fuses=0x04
atmega88_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex
atmega88_diy.menu.boot.optiboot.bootloader.noblink=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

atmega88_diy.menu.boot.none=No (ISP Programmer Upload)
atmega88_diy.menu.boot.none.upload.maximum_size=8192
atmega88_diy.menu.boot.none.bootloader.extended_fuses=0x05
atmega88_diy.menu.boot.none.upload.tool=arduino:avrdude
atmega88_diy.menu.boot.none.bootloader.tool=avrdude_nobootloader


# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega88_diy.menu.clock.8MHz=8MHz Internal Oscillator
atmega88_diy.menu.clock.8MHz.build.f_cpu=8000000L
atmega88_diy.menu.clock.8MHz.upload.speed=38400
atmega88_diy.menu.clock.8MHz.bootloader.low_fuses=0xE2

atmega88_diy.menu.clock.20MHz=20MHz Crystal/Resonator
atmega88_diy.menu.clock.20MHz.build.f_cpu=20000000L
atmega88_diy.menu.clock.20MHz.bootloader.low_fuses=0xFF

atmega88_diy.menu.clock.19_2MHz=19.2MHz Crystal/Resonator
atmega88_diy.menu.clock.19_2MHz.build.f_cpu=19200000L
atmega88_diy.menu.clock.19_2MHz.bootloader.low_fuses=0xFF

atmega88_diy.menu.clock.16MHz=16MHz Crystal/Resonator
atmega88_diy.menu.clock.16MHz.build.f_cpu=16000000L
atmega88_diy.menu.clock.16MHz.bootloader.low_fuses=0xFF

atmega88_diy.menu.clock.1MHz=1MHz Internal Oscillator
atmega88_diy.menu.clock.1MHz.build.f_cpu=1000000L
atmega88_diy.menu.clock.1MHz.bootloader.low_fuses=0x62
atmega88_diy.menu.clock.1MHz.upload.speed=9600


# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
atmega88_diy.menu.lto.enable=LTO Enabled
atmega88_diy.menu.lto.enable.ltocflags=-flto -fno-fat-lto-objects
atmega88_diy.menu.lto.enable.ltoelfflags=-g -flto -fuse-linker-plugin
atmega88_diy.menu.lto.enable.ltocppflags=-flto
atmega88_diy.menu.lto.enable.ltoarcmd=gcc-
atmega88_diy.menu.lto.disable=LTO Disabled
atmega88_diy.menu.lto.disable.ltocflags=
atmega88_diy.menu.lto.disable.ltoelfflags=
atmega88_diy.menu.lto.disable.ltocppflags=
atmega88_diy.menu.lto.disable.ltoarcmd=

