sleemanj/optiboot/dists/diy_atmega8_series/avr/boards.txt
# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
atmega88_diy.menu.bodlevel.2v7=2.7v
atmega88_diy.menu.bodlevel.2v7.bootloader.bod_bits=101
atmega88_diy.menu.bodlevel.disabled=Disabled
atmega88_diy.menu.bodlevel.disabled.bootloader.bod_bits=111
atmega88_diy.menu.bodlevel.4v3=4.3v
atmega88_diy.menu.bodlevel.4v3.bootloader.bod_bits=100
atmega88_diy.menu.bodlevel.1v8=1.8v
atmega88_diy.menu.bodlevel.1v8.bootloader.bod_bits=110

# Override: Clock Source Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega88_diy.menu.advclk.auto=Default

atmega88_diy.menu.advclk.i8=Internal Oscillator 8 MHz
atmega88_diy.menu.advclk.i8.bootloader.low_fuses=0xE2
atmega88_diy.menu.advclk.i8.build.f_cpu=8000000L

atmega88_diy.menu.advclk.i1=Internal Oscillator 1 MHz
atmega88_diy.menu.advclk.i1.bootloader.low_fuses=0x62
atmega88_diy.menu.advclk.i1.build.f_cpu=1000000L

atmega88_diy.menu.advclk.i128=Internal Oscillator 128 kHz
atmega88_diy.menu.advclk.i128.bootloader.low_fuses=0xE3
atmega88_diy.menu.advclk.i128.build.f_cpu=128000L

atmega88_diy.menu.advclk.xlf=Low Frequency Crystal/Resonator
atmega88_diy.menu.advclk.xlf.bootloader.low_fuses=0xE5

atmega88_diy.menu.advclk.xlf=Full Swing Crystal/Resonator 0.4-20 MHz
atmega88_diy.menu.advclk.xlf.bootloader.low_fuses=0xF7

atmega88_diy.menu.advclk.x400=Crystal/Resonator 400-900 kHz
atmega88_diy.menu.advclk.x400.bootloader.low_fuses=0xF9

atmega88_diy.menu.advclk.x900=Crystal/Resonator 900 kHz - 3 MHz
atmega88_diy.menu.advclk.x900.bootloader.low_fuses=0xFB

atmega88_diy.menu.advclk.x3=Crystal/Resonator 3-8 MHz
atmega88_diy.menu.advclk.x3.bootloader.low_fuses=0xFD

atmega88_diy.menu.advclk.x8=Crystal/Resonator 8-16 MHz 
atmega88_diy.menu.advclk.x8.bootloader.low_fuses=0xFF

atmega88_diy.menu.advclk.xc=External Clock (TCXO, OCXO...)
atmega88_diy.menu.advclk.xc.bootloader.low_fuses=0xE0

# Override: Frequency Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega88_diy.menu.advfrq.auto=Default

atmega88_diy.menu.advfrq.32k768=32.768 kHz
atmega88_diy.menu.advfrq.32k768.build.f_cpu=32768L
atmega88_diy.menu.advfrq.32k768.upload.speed=150

atmega88_diy.menu.advfrq.128k=128 kHz
atmega88_diy.menu.advfrq.128k.build.f_cpu=128000L
atmega88_diy.menu.advfrq.128k.upload.speed=300

atmega88_diy.menu.advfrq.1M=1 MHz
atmega88_diy.menu.advfrq.1M.build.f_cpu=1000000L
atmega88_diy.menu.advfrq.1M.upload.speed=9600

atmega88_diy.menu.advfrq.2M=2 MHz
atmega88_diy.menu.advfrq.2M.build.f_cpu=2000000L
atmega88_diy.menu.advfrq.2M.upload.speed=19200

atmega88_diy.menu.advfrq.4M=4 MHz
atmega88_diy.menu.advfrq.4M.build.f_cpu=4000000L
atmega88_diy.menu.advfrq.4M.upload.speed=38400

atmega88_diy.menu.advfrq.4M608=4.608 MHz
atmega88_diy.menu.advfrq.4M608.build.f_cpu=4608000L
atmega88_diy.menu.advfrq.4M608.upload.speed=115200

atmega88_diy.menu.advfrq.4M8=4.8 MHz
atmega88_diy.menu.advfrq.4M8.build.f_cpu=4800000L
atmega88_diy.menu.advfrq.4M8.upload.speed=19200

atmega88_diy.menu.advfrq.6M=6 MHz
atmega88_diy.menu.advfrq.6M.build.f_cpu=6000000L
atmega88_diy.menu.advfrq.6M.upload.speed=57600

atmega88_diy.menu.advfrq.6M4=6.4 MHz
atmega88_diy.menu.advfrq.6M4.build.f_cpu=6400000L
atmega88_diy.menu.advfrq.6M4.upload.speed=115200

atmega88_diy.menu.advfrq.8M=8 MHz
atmega88_diy.menu.advfrq.8M.build.f_cpu=8000000L
atmega88_diy.menu.advfrq.8M.upload.speed=38400

atmega88_diy.menu.advfrq.9M6=9.6 MHz
atmega88_diy.menu.advfrq.9M6.build.f_cpu=9600000L
atmega88_diy.menu.advfrq.9M6.upload.speed=57600

atmega88_diy.menu.advfrq.10M=10 MHz
atmega88_diy.menu.advfrq.10M.build.f_cpu=10000000L
atmega88_diy.menu.advfrq.10M.upload.speed=115200

atmega88_diy.menu.advfrq.12M=12 MHz
atmega88_diy.menu.advfrq.12M.build.f_cpu=12000000L
atmega88_diy.menu.advfrq.12M.upload.speed=115200

atmega88_diy.menu.advfrq.12M8=12.8 MHz
atmega88_diy.menu.advfrq.12M8.build.f_cpu=12800000L
atmega88_diy.menu.advfrq.12M8.upload.speed=115200

atmega88_diy.menu.advfrq.15M36=15.36 MHz
atmega88_diy.menu.advfrq.15M36.build.f_cpu=15360000L
atmega88_diy.menu.advfrq.15M36.upload.speed=57600

atmega88_diy.menu.advfrq.16M=16 MHz
atmega88_diy.menu.advfrq.16M.build.f_cpu=16000000L
atmega88_diy.menu.advfrq.16M.upload.speed=57600

atmega88_diy.menu.advfrq.19M2=19.2 MHz
atmega88_diy.menu.advfrq.19M2.build.f_cpu=19200000L
atmega88_diy.menu.advfrq.19M2.upload.speed=115200

atmega88_diy.menu.advfrq.20M=20 MHz
atmega88_diy.menu.advfrq.20M.build.f_cpu=20000000L
atmega88_diy.menu.advfrq.20M.upload.speed=115200

atmega88_diy.menu.advfrq.24M=24 MHz
atmega88_diy.menu.advfrq.24M.build.f_cpu=24000000L
atmega88_diy.menu.advfrq.24M.upload.speed=115200

# Override: Upload Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega88_diy.menu.advups.auto=Default

atmega88_diy.menu.advups.115200=115200
atmega88_diy.menu.advups.115200.upload.speed=115200

atmega88_diy.menu.advups.57600=57600
atmega88_diy.menu.advups.57600.upload.speed=57600

atmega88_diy.menu.advups.38400=38400
atmega88_diy.menu.advups.38400.upload.speed=38400

atmega88_diy.menu.advups.19200=19200
atmega88_diy.menu.advups.19200.upload.speed=19200

atmega88_diy.menu.advups.9600=9600
atmega88_diy.menu.advups.9600.upload.speed=9600

atmega88_diy.menu.advups.2400=2400
atmega88_diy.menu.advups.2400.upload.speed=2400

atmega88_diy.menu.advups.1200=1200
atmega88_diy.menu.advups.1200.upload.speed=1200

atmega88_diy.menu.advups.300=300
atmega88_diy.menu.advups.300.upload.speed=300

atmega88_diy.menu.advups.150=150
atmega88_diy.menu.advups.150.upload.speed=150

# }}}




################################################################################
# ATMEGA168/A/P/PA/PB
#
# EXTENDED FUSES NOTES
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# avrdude masks out some bits of the extended fuse on read, which would result 
# in verification error of the extended fuse if you give it an unmasked value
#
# The best idea is to use this fuse calculator
#
#     http://www.engbedded.com/fusecalc/ 
#
# which will helpfully tell you in red underneat the AVRDUDE arguments section
# if you should change the fuse, for example if you use that calculator with
# say "F5" for the extended fuse, and ATMega328P selected as the part name,
# then it will tell you "Note that there are some...." and that you  should use 
# "Extended: 0x05" instead.
#
################################################################################
# {{{

atmega168_diy.name=ATmega168/A/P/PA/PB
atmega168_diy.bootloader.low_fuses=0xE2
atmega168_diy.bootloader.high_fuses=0b11011{bootloader.bod_bits}
atmega168_diy.bootloader.bod_bits=101
atmega168_diy.bootloader.extended_fuses=0x04
atmega168_diy.bootloader.unlock_bits=0x3F
atmega168_diy.bootloader.lock_bits=0x3F
atmega168_diy.build.mcu=atmega168p
atmega168_diy.build.f_cpu=8000000L
atmega168_diy.upload.speed=57600
atmega168_diy.build.core=arduino:arduino
atmega168_diy.build.variant=arduino:standard
atmega168_diy.build.board=ATMEGA168_DIY
atmega168_diy.upload.tool=arduino:avrdude
atmega168_diy.bootloader.tool=arduino:avrdude

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

