sleemanj/optiboot/dists/diy_atmega8_series/avr/boards.txt
atmega168_diy.menu.version.atmega168p = Atmega168P
atmega168_diy.menu.version.atmega168p.build.mcu = atmega168p

atmega168_diy.menu.version.atmega168pa = Atmega168PA
atmega168_diy.menu.version.atmega168pa.build.mcu = atmega168p

atmega168_diy.menu.version.atmega168pb = Atmega168PB
atmega168_diy.menu.version.atmega168pb.build.mcu = atmega168p

atmega168_diy.menu.version.atmega168  = ATmega168
atmega168_diy.menu.version.atmega168.build.mcu = atmega168

atmega168_diy.menu.version.atmega168a  = ATmega168A
atmega168_diy.menu.version.atmega168a.build.mcu = atmega168

# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega168_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
atmega168_diy.menu.boot.optiboot.upload.protocol=arduino
atmega168_diy.menu.boot.optiboot.upload.maximum_size=15872
atmega168_diy.menu.boot.optiboot.bootloader.extended_fuses=0x04
atmega168_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex
atmega168_diy.menu.boot.optiboot.bootloader.noblink=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

atmega168_diy.menu.boot.none=No (ISP Programmer Upload)
atmega168_diy.menu.boot.none.upload.maximum_size=16384
atmega168_diy.menu.boot.none.bootloader.extended_fuses=0x05
atmega168_diy.menu.boot.none.upload.tool=arduino:avrdude
atmega168_diy.menu.boot.none.bootloader.tool=avrdude_nobootloader


# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega168_diy.menu.clock.8MHz=8MHz Internal Oscillator
atmega168_diy.menu.clock.8MHz.build.f_cpu=8000000L
atmega168_diy.menu.clock.8MHz.upload.speed=38400
atmega168_diy.menu.clock.8MHz.bootloader.low_fuses=0xE2

atmega168_diy.menu.clock.20MHz=20MHz Crystal/Resonator
atmega168_diy.menu.clock.20MHz.build.f_cpu=20000000L
atmega168_diy.menu.clock.20MHz.bootloader.low_fuses=0xFF

atmega168_diy.menu.clock.19_2MHz=19.2MHz Crystal/Resonator
atmega168_diy.menu.clock.19_2MHz.build.f_cpu=19200000L
atmega168_diy.menu.clock.19_2MHz.bootloader.low_fuses=0xFF

atmega168_diy.menu.clock.16MHz=16MHz Crystal/Resonator
atmega168_diy.menu.clock.16MHz.build.f_cpu=16000000L
atmega168_diy.menu.clock.16MHz.bootloader.low_fuses=0xFF

atmega168_diy.menu.clock.1MHz=1MHz Internal Oscillator
atmega168_diy.menu.clock.1MHz.build.f_cpu=1000000L
atmega168_diy.menu.clock.1MHz.bootloader.low_fuses=0x62
atmega168_diy.menu.clock.1MHz.upload.speed=9600

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
atmega168_diy.menu.lto.enable=LTO Enabled
atmega168_diy.menu.lto.enable.ltocflags=-flto -fno-fat-lto-objects
atmega168_diy.menu.lto.enable.ltoelfflags=-g -flto -fuse-linker-plugin
atmega168_diy.menu.lto.enable.ltocppflags=-flto
atmega168_diy.menu.lto.enable.ltoarcmd=gcc-
atmega168_diy.menu.lto.disable=LTO Disabled
atmega168_diy.menu.lto.disable.ltocflags=
atmega168_diy.menu.lto.disable.ltoelfflags=
atmega168_diy.menu.lto.disable.ltocppflags=
atmega168_diy.menu.lto.disable.ltoarcmd=

# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
atmega168_diy.menu.bodlevel.2v7=2.7v
atmega168_diy.menu.bodlevel.2v7.bootloader.bod_bits=101
atmega168_diy.menu.bodlevel.disabled=Disabled
atmega168_diy.menu.bodlevel.disabled.bootloader.bod_bits=111
atmega168_diy.menu.bodlevel.4v3=4.3v
atmega168_diy.menu.bodlevel.4v3.bootloader.bod_bits=100
atmega168_diy.menu.bodlevel.1v8=1.8v
atmega168_diy.menu.bodlevel.1v8.bootloader.bod_bits=110

# Override: Clock Source Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega168_diy.menu.advclk.auto=Default

atmega168_diy.menu.advclk.i8=Internal Oscillator 8 MHz
atmega168_diy.menu.advclk.i8.bootloader.low_fuses=0xE2
atmega168_diy.menu.advclk.i8.build.f_cpu=8000000L

atmega168_diy.menu.advclk.i1=Internal Oscillator 1 MHz
atmega168_diy.menu.advclk.i1.bootloader.low_fuses=0x62
atmega168_diy.menu.advclk.i1.build.f_cpu=1000000L

atmega168_diy.menu.advclk.i128=Internal Oscillator 128 kHz
atmega168_diy.menu.advclk.i128.bootloader.low_fuses=0xE3
atmega168_diy.menu.advclk.i128.build.f_cpu=128000L

atmega168_diy.menu.advclk.xlf=Low Frequency Crystal/Resonator
atmega168_diy.menu.advclk.xlf.bootloader.low_fuses=0xE5

atmega168_diy.menu.advclk.xlf=Full Swing Crystal/Resonator 0.4-20 MHz
atmega168_diy.menu.advclk.xlf.bootloader.low_fuses=0xF7

atmega168_diy.menu.advclk.x400=Crystal/Resonator 400-900 kHz
atmega168_diy.menu.advclk.x400.bootloader.low_fuses=0xF9

atmega168_diy.menu.advclk.x900=Crystal/Resonator 900 kHz - 3 MHz
atmega168_diy.menu.advclk.x900.bootloader.low_fuses=0xFB

atmega168_diy.menu.advclk.x3=Crystal/Resonator 3-8 MHz
atmega168_diy.menu.advclk.x3.bootloader.low_fuses=0xFD

atmega168_diy.menu.advclk.x8=Crystal/Resonator 8-16 MHz 
atmega168_diy.menu.advclk.x8.bootloader.low_fuses=0xFF

atmega168_diy.menu.advclk.xc=External Clock (TCXO, OCXO...)
atmega168_diy.menu.advclk.xc.bootloader.low_fuses=0xE0

# Override: Frequency Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega168_diy.menu.advfrq.auto=Default

atmega168_diy.menu.advfrq.32k768=32.768 kHz
atmega168_diy.menu.advfrq.32k768.build.f_cpu=32768L
atmega168_diy.menu.advfrq.32k768.upload.speed=150

atmega168_diy.menu.advfrq.128k=128 kHz
atmega168_diy.menu.advfrq.128k.build.f_cpu=128000L
atmega168_diy.menu.advfrq.128k.upload.speed=300

atmega168_diy.menu.advfrq.1M=1 MHz
atmega168_diy.menu.advfrq.1M.build.f_cpu=1000000L
atmega168_diy.menu.advfrq.1M.upload.speed=9600

atmega168_diy.menu.advfrq.2M=2 MHz
atmega168_diy.menu.advfrq.2M.build.f_cpu=2000000L
atmega168_diy.menu.advfrq.2M.upload.speed=19200

atmega168_diy.menu.advfrq.4M=4 MHz
atmega168_diy.menu.advfrq.4M.build.f_cpu=4000000L
atmega168_diy.menu.advfrq.4M.upload.speed=38400

atmega168_diy.menu.advfrq.4M608=4.608 MHz
atmega168_diy.menu.advfrq.4M608.build.f_cpu=4608000L
atmega168_diy.menu.advfrq.4M608.upload.speed=115200

atmega168_diy.menu.advfrq.4M8=4.8 MHz
atmega168_diy.menu.advfrq.4M8.build.f_cpu=4800000L
atmega168_diy.menu.advfrq.4M8.upload.speed=19200

atmega168_diy.menu.advfrq.6M=6 MHz
atmega168_diy.menu.advfrq.6M.build.f_cpu=6000000L
atmega168_diy.menu.advfrq.6M.upload.speed=57600

atmega168_diy.menu.advfrq.6M4=6.4 MHz
atmega168_diy.menu.advfrq.6M4.build.f_cpu=6400000L
atmega168_diy.menu.advfrq.6M4.upload.speed=115200

atmega168_diy.menu.advfrq.8M=8 MHz
atmega168_diy.menu.advfrq.8M.build.f_cpu=8000000L
atmega168_diy.menu.advfrq.8M.upload.speed=38400

atmega168_diy.menu.advfrq.9M6=9.6 MHz
atmega168_diy.menu.advfrq.9M6.build.f_cpu=9600000L
atmega168_diy.menu.advfrq.9M6.upload.speed=57600

atmega168_diy.menu.advfrq.10M=10 MHz
atmega168_diy.menu.advfrq.10M.build.f_cpu=10000000L
atmega168_diy.menu.advfrq.10M.upload.speed=115200

atmega168_diy.menu.advfrq.12M=12 MHz
atmega168_diy.menu.advfrq.12M.build.f_cpu=12000000L
atmega168_diy.menu.advfrq.12M.upload.speed=115200

atmega168_diy.menu.advfrq.12M8=12.8 MHz
atmega168_diy.menu.advfrq.12M8.build.f_cpu=12800000L
atmega168_diy.menu.advfrq.12M8.upload.speed=115200

atmega168_diy.menu.advfrq.15M36=15.36 MHz
atmega168_diy.menu.advfrq.15M36.build.f_cpu=15360000L
atmega168_diy.menu.advfrq.15M36.upload.speed=57600

atmega168_diy.menu.advfrq.16M=16 MHz
atmega168_diy.menu.advfrq.16M.build.f_cpu=16000000L
atmega168_diy.menu.advfrq.16M.upload.speed=57600

atmega168_diy.menu.advfrq.19M2=19.2 MHz
atmega168_diy.menu.advfrq.19M2.build.f_cpu=19200000L
atmega168_diy.menu.advfrq.19M2.upload.speed=115200

atmega168_diy.menu.advfrq.20M=20 MHz
atmega168_diy.menu.advfrq.20M.build.f_cpu=20000000L
atmega168_diy.menu.advfrq.20M.upload.speed=115200

atmega168_diy.menu.advfrq.24M=24 MHz
atmega168_diy.menu.advfrq.24M.build.f_cpu=24000000L
atmega168_diy.menu.advfrq.24M.upload.speed=115200

# Override: Upload Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega168_diy.menu.advups.auto=Default

atmega168_diy.menu.advups.115200=115200
atmega168_diy.menu.advups.115200.upload.speed=115200

atmega168_diy.menu.advups.57600=57600
atmega168_diy.menu.advups.57600.upload.speed=57600

atmega168_diy.menu.advups.38400=38400
atmega168_diy.menu.advups.38400.upload.speed=38400

atmega168_diy.menu.advups.19200=19200
atmega168_diy.menu.advups.19200.upload.speed=19200

atmega168_diy.menu.advups.9600=9600
atmega168_diy.menu.advups.9600.upload.speed=9600

atmega168_diy.menu.advups.2400=2400
atmega168_diy.menu.advups.2400.upload.speed=2400

atmega168_diy.menu.advups.1200=1200
atmega168_diy.menu.advups.1200.upload.speed=1200

atmega168_diy.menu.advups.300=300
atmega168_diy.menu.advups.300.upload.speed=300

atmega168_diy.menu.advups.150=150
atmega168_diy.menu.advups.150.upload.speed=150

# }}}

